#include <iostream>
#include <math.h>

using namespace std;

int main()
{
    while(true){
    float x, y, y1, y2;
    cout << "Input X: " << endl; 
    cin >> x; //Вводимо координату х
    cout << "Input Y: " << endl; 
    cin >> y; //Вводимо координату y

    if (-1 <= x && x <= 3){ //Перевіряємо, чи належить введений x дозволеній зоні
        if (-1 <= x && x <= 1){ //Перевіряємо, чи належить х півколу
            y1 = sqrt(4 - pow((x-1),2)); //Підставимо х у формулу кола щоб найти дозволену границю у для введеного х
            if (-y1 <= y && y <= y1){ //Перевіряємо, чи належить введений у дозволеній зоні заштрихованої фігури
                printf("In!\n");
            }
            else{
            printf("Out!\n");
            }
        }
        else{
            y2 = 3 - x; //Підставимо х у формулу прямої щоб найти дозволену границю у для введеного х
            if (-y2 <= y && y <= y2){ //Перевіряємо, чи належить введений у дозволеній зоні заштрихованої фігури
                printf("In!\n");
            }
            else{
            printf("Out!\n");
            }
        }
    }
    else {
        printf("Out!\n");
    }
    system("PAUSE");
    }
}