for i in range(101):
    if int(i / 10) == i % 10 or i < 10:
        sqrd_number = i ** 2  # У цю змінну записуємо числов квадраті
        reversed_number = 0  # Визначаємо перевернуте число

        while sqrd_number > 0:  # Поки число в квадраті більше нуля
            current = sqrd_number % 10  # Поточне число для розглядання = остання цифра числа в квадраті
            reversed_number = (reversed_number * 10) + current  # Додаємо до перевернутого числа, помноженого на 10, поточне число
            sqrd_number //= 10  # "Забираємо" у числа в квадраті останню цифру

        sqrd_number = i ** 2  # Вертаємо числу в квадраті його початкове значення для співставлення
        if reversed_number == sqrd_number:  # Якщо число в квадраті = розгорнутом, то виводимо його і його квадратний корінь
            print(i, sqrd_number)
